[
	{
		"title": "Co-Founder",
		"company": "UpSpeech",
		"period": "2024 – Present",
		"description": "Co-founded a speech therapy SaaS platform for speech-language pathologists. Built the full platform from scratch — a multi-tenant application with session management, clinical report generation, patient progress tracking, and deployment infrastructure. Responsible for architecture decisions, product direction, and full-stack development across Rails and React.",
		"logo": "/images/companies/upspeech.png",
		"skills": ["Rails", "React", "TypeScript", "PostgreSQL", "Docker"],
		"achievements": [
			"Built entire platform from zero to production",
			"Designed multi-tenant SaaS architecture"
		]
	},
	{
		"title": "Full-Stack Engineer",
		"company": "Pixelmatters",
		"period": "2025 – Present",
		"description": "Working as a full-stack engineer at Pixelmatters, a digital product studio that partners with ambitious tech companies to design, build, and scale standout digital products. Currently building features for UJET.cx, an AI-powered cloud contact center platform, using Ruby on Rails and Angular.",
		"logo": "/images/companies/pixelmatters.png",
		"skills": ["Rails", "Ruby", "Angular", "TypeScript", "PostgreSQL", "Git"],
		"achievements": []
	},
	{
		"title": "Ruby on Rails Developer",
		"company": "Medihive",
		"period": "2022 – 2025",
		"description": "At Medihive, I worked mostly with Ruby on Rails in a cross-functional team focused on delivering the best possible product to our clients. I worked on the company's internal tools, such as the admin panel and doctor panels, as well as the client-facing website. As a full-stack developer, I also worked on the front-end, using mostly ERB and some React. I gradually increased my responsibilities, owning and developing features end-to-end.",
		"logo": "/images/companies/medihive.jpg",
		"skills": ["Rails", "Ruby", "React", "ERB", "Turbo", "PostgreSQL", "MySQL", "Git"],
		"achievements": [
			"Led several features from inception to production",
			"Promoted to Senior Developer"
		]
	},
	{
		"title": "Ruby on Rails Developer",
		"company": "Bit Zesty",
		"period": "2021 – 2022",
		"description": "As a Full-Stack Software Developer at BitZesty, I've had the opportunity to work fully remotely in Ruby on Rails on a cross-functional team. Here I worked on several projects with different ruby and rails versions, trying to find the best budget conscious solution for clients.",
		"logo": "/images/companies/bitzesty.jpg",
		"achievements": [
			"Upgraded several projects from Rails 5 to Rails 6",
			"Led the development of a new feature for a client"
		],
		"skills": ["Rails", "Ruby", "React", "ElasticSearch", "CSS", "PostgreSQL", "Heroku", "Git"]
	},
	{
		"title": "Full-Stack Developer",
		"company": "Landing.Jobs",
		"period": "2020 – 2021",
		"description": "I worked my way up from Junior to Mid-Level Software Developer in under a year. I had the opportunity to work with Ruby on Rails, React, Typescript, GraphQL and CSS. This was my first developing job and I was able to apply my skills in a real-world setting, contributing to the company's success.",
		"logo": "/images/companies/landingjobs.png",
		"achievements": [
			"Promoted to Mid-Level Developer in 12 months",
			"Revelation of the Year internal award for 2020"
		],
		"skills": ["Rails", "Ruby", "React", "GraphQL", "Docker", "CSS", "PostgreSQL", "Heroku", "Git"]
	},
	{
		"title": "Technology Trainee",
		"company": "Accenture Portugal",
		"period": "2019 – 2022",
		"description": "At Accenture, I mainly worked with VBA and a Customer Care & Billing software, in Java. It was my first experience with any of these languages, which I acquired reasonably quickly at a basic level.",
		"logo": "/images/companies/accenture.png",
		"skills": ["VBA", "Java", "SQL", "Unix", "JavaScript"]
	},
	{
		"title": "Junior Consultant",
		"company": "WeDo Technologies",
		"period": "2019",
		"description": "During my tenure at WeDo Technologies (now Mobileum), I worked with their proprietary software 'RAID'. This is a logic based development software. I had the chance to work in a very small team and work a bit with unix, VMs and JavaScript.",
		"logo": "/images/companies/wedo.jpg",
		"skills": ["JavaScript", "Unix", "SQL", "RAID"]
	}
]
