[
	{
		"title": "Student Mental Health Support Program",
		"slug": "student-mental-health-program",
		"description": "Comprehensive mental health support program for adolescents experiencing mood disorders and anxiety.",
		"details": "Developed and implemented a comprehensive mental health support program at St. Dominic's International School, focusing on students with mood disorders, anxiety, and emerging personality disorders. The program utilizes evidence-based CBT techniques and provides both individual and group therapy sessions, helping students develop practical strategies for managing their mental health.",
		"stack": [
			"Cognitive Behavioural Therapy",
			"Individual Therapy",
			"Group Therapy",
			"Crisis Intervention",
			"Mental Health Assessment",
			"Student Support Systems"
		],
		"images": [],
		"github": "",
		"updatedAt": "2025-09-01",
		"link": ""
	},
	{
		"title": "Cross-Cultural Psychology Research",
		"slug": "cross-cultural-psychology",
		"description": "Research into consumer psychology and cross-cultural behaviour patterns.",
		"details": "Conducted research in marketing and consumer psychology, analyzing cross-cultural behaviour patterns and decision-making processes. This research enhanced understanding of cultural influences on psychological processes and contributed to evidence-based approaches in multicultural settings.",
		"stack": [
			"SPSS",
			"Research Methodology",
			"Statistical Analysis",
			"Cross-cultural Psychology",
			"Consumer Behaviour"
		],
		"images": [],
		"github": "",
		"updatedAt": "2019-01-01",
		"link": ""
	},
	{
		"title": "Disability Support Initiative",
		"slug": "disability-support",
		"description": "One-to-one support program for young adults with disabilities.",
		"details": "Provided comprehensive support to young adults with disabilities through Cherish, a non-profit organization in Brighton. Developed individualized support plans, taught daily life skills, and facilitated social inclusion during evening sessions and holiday programs. This experience strengthened skills in adaptive communication and person-centered care.",
		"stack": [
			"Disability Support",
			"Life Skills Training",
			"Adaptive Communication",
			"Person-centered Care",
			"Social Inclusion"
		],
		"images": [],
		"github": "",
		"updatedAt": "2017-01-01",
		"link": ""
	}
]
